InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц/Ext/ManagerModule.bsl
Функция ПолучитьФотоФизЛица(ФизЛицо, ТипФото ="") Экспорт
	
	Если не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат БиблиотекаКартинок.ИА_НетАватара.ПолучитьДвоичныеДанные();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.Фото"+ТипФото+" КАК Фото
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|ГДЕ
		|	ИА_ДанныеФизЛиц.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Фото = Неопределено;
	
	Если Выборка.Следующий() Тогда
		ФотоХр = Выборка.Фото;
		Если ФотоХр <> Неопределено Тогда
			Фото = ФотоХр.Получить();
		КонецЕсли;
	КонецЕсли;

	Если фото = Неопределено Тогда
		Фото = БиблиотекаКартинок.ИА_НетАватара.ПолучитьДвоичныеДанные();
	КонецЕсли;
	
	Возврат Фото;
	
КонецФункции // ПолучитьФотоФизЛица()

Функция ПолучитьФотоПользователя(Пользователь, ТипФото ="") Экспорт
	
	Если не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат БиблиотекаКартинок.ИА_НетАватара.ПолучитьДвоичныеДанные();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.Фото"+ТипФото+" КАК Фото
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|ГДЕ
		|	ИА_ДанныеФизЛиц.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Фото = Неопределено;
	
	Если Выборка.Следующий() Тогда
		ФотоХр = Выборка.Фото;
		Если ФотоХр <> Неопределено Тогда
			Фото = ФотоХр.Получить();
		КонецЕсли;
	КонецЕсли;

	Если фото = Неопределено Тогда
		Фото = БиблиотекаКартинок.ИА_НетАватара.ПолучитьДвоичныеДанные();
	КонецЕсли;
	Возврат Фото;
	
КонецФункции // ПолучитьФотоФизЛица()

Функция ПолучитьВерсиюФотоФизЛица(ФизЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.ВерсияФото
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|ГДЕ
		|	ИА_ДанныеФизЛиц.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВерсияФото = ВыборкаДетальныеЗаписи.ВерсияФото;
	КонецЦикла;

	Возврат ВерсияФото;
	
КонецФункции // ПолучитьВерсиюФотоФизЛица()

Функция ПолучитьВерсиюИФотоФизЛица(ФизЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.ВерсияФото,
		|	ИА_ДанныеФизЛиц.Фото
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|ГДЕ
		|	ИА_ДанныеФизЛиц.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура("ВерсияФото, Фото");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции // ПолучитьВерсиюИФотоФизЛица()

Функция ПолучитьПользователяФизЛица(ФизЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.Пользователь
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|ГДЕ
		|	ИА_ДанныеФизЛиц.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
	КонецЦикла;

	Возврат Пользователь;
	
КонецФункции // ПолучитьПользователяФизЛица()
